app/controllers/movies_controller.rb

  def index
    if params.has_key?("sort_by_title")
      @movies = Movie.all.sort { |m1, m2| m1.title <=> m2.title }
---
SELECT "movies".* FROM "movies"